app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "due", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Clean"], ["due", "2018-01-01"], ["note", "Just do it!"], ["created_at", "2018-01-12 00:26:27.061377"], ["updated_at", "2018-01-12 00:26:27.061377"]]